# SsePointBasetypeEnum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SsePointBasetypeEnum Property
ParameterTypeId Class See Also
---
"Point Base Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SsePointBasetypeEnum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SsePointBasetypeEnum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SsePointBasetypeEnum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace